export default {
  'character': {
    'ama': [
      {
        'name': '眩晕震波',
        'class': '空中',
        'max': '7',
        'level': [0, 6, 12, 18, 25, 33, 42],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['', '', '', '', '', '', ''],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '割喉者',
        'class': '空中',
        'max': '10',
        'level': [3, 8, 14, 20, 26, 32, 38, 44, 50, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['', '', '', '', '', '', '', '', '', ''],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '致命回旋',
        'class': '空中',
        'max': '7',
        'level': [11, 17, 23, 29, 36, 45, 54],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['', '', '', '', '', '', ''],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '蛮力猛击',
        'class': '地面',
        'max': '10',
        'level': [0, 6, 12, 18, 24, 30, 37, 44, 51, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['', '', '', '', '', '', '', '', '', ''],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '招架',
        'class': '地面',
        'max': '10',
        'level': [4, 9, 14, 20, 26, 32, 38, 45, 52, 59],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['', '', '', '', '', '', '', '', '', ''],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 3, 4]
      },
      {
        'name': '痛击',
        'class': '地面',
        'max': '3',
        'level': [10, 21, 40],
        'require': [0, 0, 3],
        'detail': ['', '', ''],
        'sp': [1, 2, 3]
      },
      {
        'name': '狂舞连击',
        'class': '地面',
        'max': '5',
        'level': [15, 22, 30, 39, 48],
        'require': [0, 0, 3, 3, 6],
        'detail': ['', '', '', '', ''],
        'sp': [3, 1, 2, 3, 5]
      },
      {
        'name': '狂暴化',
        'class': '辅助',
        'max': '10',
        'level': [0, 7, 13, 19, 25, 31, 37, 43, 49, 55],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['', '', '', '', '', '', '', '', '', ''],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '肾上腺素爆发',
        'class': '辅助',
        'max': '7',
        'level': [0, 6, 12, 20, 28, 38, 51],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['', '', '', '', '', '', ''],
        'sp': [1, 1, 2, 2, 3, 3, 4]
      },
      {
        'name': '战纹',
        'class': '辅助',
        'max': '3',
        'level': [5, 27, 46],
        'require': [0, 0, 3],
        'detail': ['', '', ''],
        'sp': [2, 3, 4]
      },
      {
        'name': '激发狂怒',
        'class': '辅助',
        'max': '3',
        'level': [9, 20, 34],
        'require': [0, 0, 3],
        'detail': ['', '', ''],
        'sp': [1, 2, 3]
      },
      {
        'name': '钢铁意志',
        'class': '辅助',
        'max': '5',
        'level': [13, 21, 29, 40, 52],
        'require': [0, 0, 3, 3, 6],
        'detail': ['', '', '', '', ''],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'fit': [],

    'drf': [],

    'elf': [],

    'wiz': [],

    'sor': []
  },
  'common': [
    {
      'name': '滑踢',
      'class': '一般',
      'max': '5',
      'level': [1, 10, 20, 31, 40],
      'require': [0, 0, 3, 3, 6],
      'detail': ['滑铲威力30，击退30%', '滑铲威力34，击退40%', '滑铲威力40，击退55%', '滑铲威力46，击退70%', '滑铲威力60，击退100%'],
      'sp': [1, 2, 4, 7, 11]
    },
    {
      'name': '金币治疗',
      'class': '一般',
      'max': '5',
      'level': [1, 5, 14, 27, 42],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时HP回复+2', '取得硬币时HP回复+3', '取得硬币时HP回复+5', '取得硬币时HP回复+7', '取得硬币时HP回复+10'],
      'sp': [1, 2, 4, 7, 11]
    },
    {
      'name': '金币得分',
      'class': '一般',
      'max': '5',
      'level': [1, 8, 17, 29, 43],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时取得分数10', '取得硬币时取得分数20', '取得硬币时取得分数40', '取得硬币时取得分数60', '取得硬币时取得分数100'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '提升生命力',
      'class': '一般',
      'max': '10',
      'level': [0, 7, 13, 19, 25, 31, 38, 45, 52, 59],
      'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
      'detail': ['HP+20', 'HP+35', 'HP+50', 'HP+65', 'HP+80', 'HP+100', 'HP+120', 'HP+145', 'HP+170', 'HP+200'],
      'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
    },
    {
      'name': '营养学家',
      'class': '一般',
      'max': '5',
      'level': [3, 11, 24, 37, 51],
      'require': [0, 0, 3, 3, 6],
      'detail': ['食物的HP回复量+20%', '食物的HP回复量+25%', '食物的HP回复量+30%', '食物的HP回复量+35%', '食物的HP回复量+50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '保养装备',
      'class': '一般',
      'max': '5',
      'level': [6, 13, 23, 34, 47],
      'require': [0, 0, 3, 3, 6],
      'detail': ['十字弓等道具使用次数不易减少几率20%', '十字弓等道具使用次数不易减少几率25%', '十字弓等道具使用次数不易减少几率30%', '十字弓等道具使用次数不易减少几率35%', '十字弓等道具使用次数不易减少几率50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '灵巧之手',
      'class': '一般',
      'max': '7',
      'level': [9, 16, 22, 29, 36, 44, 53],
      'require': [0, 0, 3, 3, 6, 6, 9],
      'detail': ['减少道具使用后的再使用等待时间10%', '减少道具使用后的再使用等待时间15%', '减少道具使用后的再使用等待时间20%', '减少道具使用后的再使用等待时间25%', '减少道具使用后的再使用等待时间30%', '减少道具使用后的再使用等待时间35%', '减少道具使用后的再使用等待时间50%'],
      'sp': [1, 1, 2, 2, 3, 3, 5]
    },
    {
      'name': '闪避',
      'class': '一般',
      'max': '3',
      'level': [12, 32, 52],
      'require': [0, 3, 6],
      'detail': ['回避回数+1', '回避回数+2', '回避回数+3'],
      'sp': [2, 3, 4]
    },
    {
      'name': '额外口袋',
      'class': '一般',
      'max': '3',
      'level': [15, 30, 50],
      'require': [0, 3, 6],
      'detail': ['容量8', '容量9', '容量10'],
      'sp': [2, 4, 6]
    }
  ]
}
