export default {
  'character': {
    'ama': [
      {
        'name': '眩晕震波',
        'class': '空中',
        'max': 7,
        'level': [0, 6, 12, 18, 25, 33, 42],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['降落攻击时产生冲击波威力20', '降落攻击时产生冲击波威力24，距离+110%', '降落攻击时产生冲击波威力28，距离120%', '降落攻击时产生冲击波威力32，距离130%', '降落攻击时产生冲击波威力36，距离+140%', '降落攻击时产生冲击波威力40，距离+150%', '降落攻击时产生冲击波威力60，距离+190%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '割喉者',
        'class': '空中',
        'max': 10,
        'level': [3, 8, 14, 20, 26, 32, 38, 44, 50, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['落下攻击威力150，伤害+100%', '落下攻击威力155，伤害+105%', '落下攻击威力162，伤害+110%', '落下攻击威力169，伤害+115%', '落下攻击威力176，伤害+120%', '落下攻击威力182，伤害+130%', '落下攻击威力189，伤害+140%', '落下攻击威力196，伤害+155%', '落下攻击威力203，伤害+170%', '落下攻击威力230，伤害+200%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '致命回旋',
        'class': '空中',
        'max': 7,
        'level': [11, 17, 23, 29, 36, 45, 54],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['空中回转攻击回转次数2，威力+30%', '空中回转攻击回转次数2，威力+35%', '空中回转攻击回转次数2，威力+45%', '空中回转攻击回转次数3，威力+55%', '空中回转攻击回转次数3，威力+70%', '空中回转攻击回转次数3，威力+85%', '空中回转攻击回转次数4，威力+100%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '蛮力猛击',
        'class': '地面',
        'max': 10,
        'level': [0, 6, 12, 18, 24, 30, 37, 44, 51, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['重攻击威力440，冲击波威力165', '重攻击威力480，冲击波威力180，冲击波距离105%', '重攻击威力520，冲击波威力195，冲击波距离110%', '重攻击威力560，冲击波威力210，冲击波距离115%', '重攻击威力600，冲击波威力225，冲击波距离120%', '重攻击威力640，冲击波威力248，冲击波距离125%', '重攻击威力680，冲击波威力270，冲击波距离130%', '重攻击威力740，冲击波威力300，冲击波距离135%', '重攻击威力800，冲击波威力330，冲击波距离140%', '重攻击威力900，冲击波威力400，冲击波距离190%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '招架',
        'class': '地面',
        'max': 10,
        'level': [4, 9, 14, 20, 26, 32, 38, 45, 52, 59],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['架开敌人后无敌，威力100，时间2.0s', '架开敌人后无敌，威力110，时间2.3s', '架开敌人后无敌，威力120，时间2.7s', '架开敌人后无敌，威力130，时间3.0s', '架开敌人后无敌，威力140，时间3.3s', '架开敌人后无敌，威力150，时间3.7s', '架开敌人后无敌，威力160，时间4.0s', '架开敌人后无敌，威力180，时间4.3s', '架开敌人后无敌，威力190，时间4.7s', '架开敌人后无敌，威力250，时间5.0s'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 3, 4]
      },
      {
        'name': '痛击',
        'class': '地面',
        'max': 3,
        'level': [10, 21, 40],
        'require': [0, 0, 3],
        'detail': ['威力20', '威力40', '威力60'],
        'sp': [1, 2, 3]
      },
      {
        'name': '狂舞连击',
        'class': '地面',
        'max': 5,
        'level': [15, 22, 30, 39, 48],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力100，连击次数1', '威力110，连击次数2', '威力120，连击次数3', '威力130，连击次数4', '威力150，连击次数5'],
        'sp': [3, 1, 2, 3, 5]
      },
      {
        'name': '狂暴化',
        'class': '辅助',
        'max': 10,
        'level': [0, 7, 13, 19, 25, 31, 37, 43, 49, 55],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['狂暴中伤害+10%', '狂暴中伤害+15%', '狂暴中伤害+20%', '狂暴中伤害+25%', '狂暴中伤害+30%', '狂暴中伤害+35%', '狂暴中伤害+40%', '狂暴中伤害+45%', '狂暴中伤害+50%', '狂暴中伤害+60%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '肾上腺素爆发',
        'class': '辅助',
        'max': 7,
        'level': [0, 6, 12, 20, 28, 38, 51],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['HP不多时伤害+30%', 'HP不多时伤害+40%', 'HP不多时伤害+50%', 'HP不多时伤害+60%', 'HP不多时伤害+70%', 'HP不多时伤害+80%', 'HP不多时伤害+100%'],
        'sp': [1, 1, 2, 2, 3, 3, 4]
      },
      {
        'name': '战纹',
        'class': '辅助',
        'max': 3,
        'level': [5, 27, 46],
        'require': [0, 0, 3],
        'detail': ['次数3，分身数1，时间10s', '次数3，分身数1，时间15s', '次数3，分身数2，时间20s'],
        'sp': [2, 3, 4]
      },
      {
        'name': '激发狂怒',
        'class': '辅助',
        'max': 3,
        'level': [9, 20, 34],
        'require': [0, 0, 3],
        'detail': ['次数3，HP减少50%，时间3s', '次数4，HP减少60%，时间6s', '次数5，HP减少70%，时间12s'],
        'sp': [1, 2, 3]
      },
      {
        'name': '钢铁意志',
        'class': '辅助',
        'max': 5,
        'level': [13, 21, 29, 40, 52],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，时间8s，HP减少35%', '次数3，时间12s，HP减少55%', '次数4，时间12s，HP减少55%', '次数4，时间16s，HP减少75%', '次数5，时间20s，HP减少95%'],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'fit': [
      {
        'name': '飓风粉碎剑',
        'class': '攻击',
        'max': 5,
        'level': [1, 10, 19, 30, 45],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力20，降落速度-30%', '威力22，降落速度-45%', '威力23，降落速度-60%', '威力25，降落速度-75%', '威力30，降落速度95%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '音速爆裂',
        'class': '攻击',
        'max': 5,
        'level': [1, 8, 16, 26, 40],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力15，冲击波数2', '威力18，冲击波数2', '威力23，冲击波数3', '威力30，冲击波数3', '威力45，冲击波数4'],
        'sp': [2, 2, 3, 3, 4]
      },
      {
        'name': '审判剑',
        'class': '攻击',
        'max': 7,
        'level': [3, 12, 21, 30, 39, 48, 57],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['落下攻击威力40', '落下攻击威力44，冲击波范围120%', '落下攻击威力46，冲击波范围140%', '落下攻击威力48，冲击波范围160%', '落下攻击威力50，冲击波范围180', '落下攻击威力52，冲击波范围200%', '落下攻击威力60，冲击波范围300%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '惩戒剑',
        'class': '攻击',
        'max': 7,
        'level': [6, 14, 22, 31, 40, 49, 58],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['重攻击威力440，冲击波威力165', '重攻击威力480，冲击波威力180，范围115%', '重攻击威力520，冲击波威力195，范围130%', '重攻击威力560，冲击波威力210，范围145%', '重攻击威力600，冲击波威力225，范围160%', '重攻击威力640，冲击波威力240，范围185%S', '重攻击威力800，冲击波威力300，范围285%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '剑刃风暴',
        'class': '攻击',
        'max': 10,
        'level': [15, 20, 25, 30, 35, 40, 45, 50, 55, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['威力30+70，时间1.5s，范围100%', '威力33+70，时间1.9s，范围103%', '威力36+90，时间2.2s，范围106%', '威力41+90，时间2.4s，范围110%', '威力45+90，时间2.7s，范围114%', '威力50+90，时间2.9s，范围119%', '威力54+120，时间3.2s，范围124%', '威力60+120，时间3.4s，范围130%', '威力66+120，时间3.7s，范围136%', '威力75+150，时间4.2s，范围150%'],
        'sp': [3, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '掩护队友',
        'class': '防御',
        'max': 3,
        'level': [1, 17, 36],
        'require': [0, 0, 3],
        'detail': ['攻击上升40%', '攻击上升70%，范围125%', '攻击上升100%，范围200%'],
        'sp': [1, 2, 3]
      },
      {
        'name': '快速防御',
        'class': '防御',
        'max': 5,
        'level': [1, 7, 16, 27, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['自动格挡几率25%', '自动格挡几率30%', '自动格挡几率35%', '自动格挡几率40%', '自动格挡几率50%'],
        'sp': [1, 1, 2, 2, 3]
      },
      {
        'name': '盾击',
        'class': '防御',
        'max': 10,
        'level': [4, 9, 14, 19, 24, 29, 34, 40, 47, 54],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['威力20，击晕几率20%，盾击伤害+10%', '威力24，击晕几率25%，盾击伤害+20%', '威力28，击晕几率30%，盾击伤害+40%', '威力32，击晕几率35%，盾击伤害+60%', '威力36，击晕几率40%，盾击伤害+80%', '威力40，击晕几率45%，盾击伤害+100%', '威力44，击晕几率50%，盾击伤害+120%', '威力48，击晕几率55%，盾击伤害+140%', '威力52，击晕几率60%，盾击伤害+160%', '威力60，击晕几率80%，盾击伤害+200%'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 6]
      },
      {
        'name': '反弹投射攻击',
        'class': '防御',
        'max': 10,
        'level': [11, 16, 21, 27, 32, 37, 43, 48, 53, 58],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['反射几率30%', '反射几率35%，反射伤害20%', '反射几40%，反射伤害40%', '反射几率45%，反射伤害65%', '反射几率50%，反射伤害90%', '反射几率55%，反射伤害115%', '反射几率65%，反射伤害140%', '反射几率75%，反射伤害165%', '反射几率90%，反射伤害200%', '反射几率100%，反射伤害+250%'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 6]
      },
      {
        'name': '吸引注意',
        'class': '辅助',
        'max': 3,
        'level': [1, 12, 24],
        'require': [0, 0, 3],
        'detail': ['次数5，吸引敌人数5，发动伤害+10%', '次数5，吸引敌人数6，发动伤害+20%', '次数5，吸引敌人数9，发动伤害+30%'],
        'sp': [1, 2, 3]
      },
      {
        'name': '自我牺牲',
        'class': '辅助',
        'max': 5,
        'level': [5, 11, 19, 29, 42],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，发动减伤-30%', '次数3，发动减伤-40%', '次数3，发动减伤-50%', '次数3，发动减伤-60%', '次数3，发动减伤-70%'],
        'sp': [1, 1, 2, 3, 4]
      },
      {
        'name': '铜墙铁壁',
        'class': '辅助',
        'max': 10,
        'level': [9, 13, 18, 23, 28, 33, 38, 44, 50, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['防御耐久+20%，盾耐久减少-5%', '防御耐久+30%，盾耐久减少-7%', '防御耐久+40%，盾耐久减少-10%', '防御耐久+50%，盾耐久减少-13%', '防御耐久+60%，盾耐久减少-16%', '防御耐久+70%，盾耐久减少-19%', '防御耐久+85%，盾耐久减少-25%', '防御耐久+100%，盾耐久减少-31%', '防御耐久+120%，盾耐久减少-40%', '防御耐久+150%，盾耐久减少-50%'],
        'sp': [1, 1, 2, 2, 3, 3, 4, 4, 5, 6]
      }
    ],

    'drf': [],

    'elf': [],

    'wiz': [],

    'sor': []
  },
  'common': [
    {
      'name': '滑踢',
      'class': '一般',
      'max': 5,
      'level': [1, 10, 20, 31, 40],
      'require': [0, 0, 3, 3, 6],
      'detail': ['滑铲威力30，击退30%', '滑铲威力34，击退40%', '滑铲威力40，击退55%', '滑铲威力46，击退70%', '滑铲威力60，击退100%'],
      'sp': [1, 2, 4, 7, 11]
    },
    {
      'name': '金币治疗',
      'class': '一般',
      'max': 5,
      'level': [1, 5, 14, 27, 42],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时HP回复+2', '取得硬币时HP回复+3', '取得硬币时HP回复+5', '取得硬币时HP回复+7', '取得硬币时HP回复+10'],
      'sp': [1, 2, 4, 7, 11]
    },
    {
      'name': '金币得分',
      'class': '一般',
      'max': 5,
      'level': [1, 8, 17, 29, 43],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时取得分数10', '取得硬币时取得分数20', '取得硬币时取得分数40', '取得硬币时取得分数60', '取得硬币时取得分数100'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '提升生命力',
      'class': '一般',
      'max': 10,
      'level': [0, 7, 13, 19, 25, 31, 38, 45, 52, 59],
      'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
      'detail': ['HP+20', 'HP+35', 'HP+50', 'HP+65', 'HP+80', 'HP+100', 'HP+120', 'HP+145', 'HP+170', 'HP+200'],
      'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
    },
    {
      'name': '营养学家',
      'class': '一般',
      'max': 5,
      'level': [3, 11, 24, 37, 51],
      'require': [0, 0, 3, 3, 6],
      'detail': ['食物的HP回复量+20%', '食物的HP回复量+25%', '食物的HP回复量+30%', '食物的HP回复量+35%', '食物的HP回复量+50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '保养装备',
      'class': '一般',
      'max': 5,
      'level': [6, 13, 23, 34, 47],
      'require': [0, 0, 3, 3, 6],
      'detail': ['十字弓等道具使用次数不易减少几率20%', '十字弓等道具使用次数不易减少几率25%', '十字弓等道具使用次数不易减少几率30%', '十字弓等道具使用次数不易减少几率35%', '十字弓等道具使用次数不易减少几率50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '灵巧之手',
      'class': '一般',
      'max': 7,
      'level': [9, 16, 22, 29, 36, 44, 53],
      'require': [0, 0, 3, 3, 6, 6, 9],
      'detail': ['减少道具使用后的再使用等待时间10%', '减少道具使用后的再使用等待时间15%', '减少道具使用后的再使用等待时间20%', '减少道具使用后的再使用等待时间25%', '减少道具使用后的再使用等待时间30%', '减少道具使用后的再使用等待时间35%', '减少道具使用后的再使用等待时间50%'],
      'sp': [1, 1, 2, 2, 3, 3, 5]
    },
    {
      'name': '闪避',
      'class': '一般',
      'max': 3,
      'level': [12, 32, 52],
      'require': [0, 3, 6],
      'detail': ['回避回数+1', '回避回数+2', '回避回数+3'],
      'sp': [2, 3, 4]
    },
    {
      'name': '额外口袋',
      'class': '一般',
      'max': 3,
      'level': [15, 30, 50],
      'require': [0, 3, 6],
      'detail': ['容量8', '容量9', '容量10'],
      'sp': [2, 4, 6]
    }
  ]
}
