export default {
  'character': {
    'ama': [
      {
        'name': '眩晕震波',
        'class': '空中',
        'max': 7,
        'level': [0, 6, 12, 18, 25, 33, 42],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['降落攻击时产生冲击波威力20', '降落攻击时产生冲击波威力24，距离+110%', '降落攻击时产生冲击波威力28，距离120%', '降落攻击时产生冲击波威力32，距离130%', '降落攻击时产生冲击波威力36，距离+140%', '降落攻击时产生冲击波威力40，距离+150%', '降落攻击时产生冲击波威力60，距离+190%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '割喉者',
        'class': '空中',
        'max': 10,
        'level': [3, 8, 14, 20, 26, 32, 38, 44, 50, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['落下攻击威力150，伤害+100%', '落下攻击威力155，伤害+105%', '落下攻击威力162，伤害+110%', '落下攻击威力169，伤害+115%', '落下攻击威力176，伤害+120%', '落下攻击威力182，伤害+130%', '落下攻击威力189，伤害+140%', '落下攻击威力196，伤害+155%', '落下攻击威力203，伤害+170%', '落下攻击威力230，伤害+200%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '致命回旋',
        'class': '空中',
        'max': 7,
        'level': [11, 17, 23, 29, 36, 45, 54],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['空中回转攻击回转次数2，威力+30%', '空中回转攻击回转次数2，威力+35%', '空中回转攻击回转次数2，威力+45%', '空中回转攻击回转次数3，威力+55%', '空中回转攻击回转次数3，威力+70%', '空中回转攻击回转次数3，威力+85%', '空中回转攻击回转次数4，威力+100%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '蛮力猛击',
        'class': '地面',
        'max': 10,
        'level': [0, 6, 12, 18, 24, 30, 37, 44, 51, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['重攻击威力440，冲击波威力165', '重攻击威力480，冲击波威力180，距离105%', '重攻击威力520，冲击波威力195，距离110%', '重攻击威力560，冲击波威力210，距离115%', '重攻击威力600，冲击波威力225，距离120%', '重攻击威力640，冲击波威力248，距离125%', '重攻击威力680，冲击波威力270，距离130%', '重攻击威力740，冲击波威力300，距离135%', '重攻击威力800，冲击波威力330，距离140%', '重攻击威力900，冲击波威力400，距离190%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '招架',
        'class': '地面',
        'max': 10,
        'level': [4, 9, 14, 20, 26, 32, 38, 45, 52, 59],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['架开敌人后无敌，威力100，时间2.0s', '架开敌人后无敌，威力110，时间2.3s', '架开敌人后无敌，威力120，时间2.7s', '架开敌人后无敌，威力130，时间3.0s', '架开敌人后无敌，威力140，时间3.3s', '架开敌人后无敌，威力150，时间3.7s', '架开敌人后无敌，威力160，时间4.0s', '架开敌人后无敌，威力180，时间4.3s', '架开敌人后无敌，威力190，时间4.7s', '架开敌人后无敌，威力250，时间5.0s'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 3, 4]
      },
      {
        'name': '痛击',
        'class': '地面',
        'max': 3,
        'level': [10, 21, 40],
        'require': [0, 0, 3],
        'detail': ['威力20', '威力40', '威力60'],
        'sp': [1, 2, 3]
      },
      {
        'name': '狂舞连击',
        'class': '地面',
        'max': 5,
        'level': [15, 22, 30, 39, 48],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力100，连击次数1', '威力110，连击次数2', '威力120，连击次数3', '威力130，连击次数4', '威力150，连击次数5'],
        'sp': [3, 1, 2, 3, 5]
      },
      {
        'name': '狂暴化',
        'class': '辅助',
        'max': 10,
        'level': [0, 7, 13, 19, 25, 31, 37, 43, 49, 55],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['狂暴中伤害+10%', '狂暴中伤害+15%', '狂暴中伤害+20%', '狂暴中伤害+25%', '狂暴中伤害+30%', '狂暴中伤害+35%', '狂暴中伤害+40%', '狂暴中伤害+45%', '狂暴中伤害+50%', '狂暴中伤害+60%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '肾上腺素爆发',
        'class': '辅助',
        'max': 7,
        'level': [0, 6, 12, 20, 28, 38, 51],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['HP不多时伤害+30%', 'HP不多时伤害+40%', 'HP不多时伤害+50%', 'HP不多时伤害+60%', 'HP不多时伤害+70%', 'HP不多时伤害+80%', 'HP不多时伤害+100%'],
        'sp': [1, 1, 2, 2, 3, 3, 4]
      },
      {
        'name': '战纹',
        'class': '辅助',
        'max': 3,
        'level': [5, 27, 46],
        'require': [0, 0, 3],
        'detail': ['次数3，分身数1，时间10s', '次数3，分身数1，时间15s', '次数3，分身数2，时间20s'],
        'sp': [2, 3, 4]
      },
      {
        'name': '激发狂怒',
        'class': '辅助',
        'max': 3,
        'level': [9, 20, 34],
        'require': [0, 0, 3],
        'detail': ['次数3，HP减少50%，时间3s', '次数4，HP减少60%，时间6s', '次数5，HP减少70%，时间12s'],
        'sp': [1, 2, 3]
      },
      {
        'name': '钢铁意志',
        'class': '辅助',
        'max': 5,
        'level': [13, 21, 29, 40, 52],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，时间8s，HP减少35%', '次数3，时间12s，HP减少55%', '次数4，时间12s，HP减少55%', '次数4，时间16s，HP减少75%', '次数5，时间20s，HP减少95%'],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'fit': [
      {
        'name': '飓风粉碎剑',
        'class': '攻击',
        'max': 5,
        'level': [1, 10, 19, 30, 45],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力20，降落速度-30%', '威力22，降落速度-45%', '威力23，降落速度-60%', '威力25，降落速度-75%', '威力30，降落速度95%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '音速爆裂',
        'class': '攻击',
        'max': 5,
        'level': [1, 8, 16, 26, 40],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力15，冲击波数2', '威力18，冲击波数2', '威力23，冲击波数3', '威力30，冲击波数3', '威力45，冲击波数4'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '审判剑',
        'class': '攻击',
        'max': 7,
        'level': [3, 12, 21, 30, 39, 48, 57],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['落下攻击威力40', '落下攻击威力44，冲击波范围120%', '落下攻击威力46，冲击波范围140%', '落下攻击威力48，冲击波范围160%', '落下攻击威力50，冲击波范围180', '落下攻击威力52，冲击波范围200%', '落下攻击威力60，冲击波范围300%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '惩戒剑',
        'class': '攻击',
        'max': 7,
        'level': [6, 14, 22, 31, 40, 49, 58],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['重攻击威力440，冲击波威力165', '重攻击威力480，冲击波威力180，范围115%', '重攻击威力520，冲击波威力195，范围130%', '重攻击威力560，冲击波威力210，范围145%', '重攻击威力600，冲击波威力225，范围160%', '重攻击威力640，冲击波威力240，范围185%S', '重攻击威力800，冲击波威力300，范围285%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '剑刃风暴',
        'class': '攻击',
        'max': 10,
        'level': [15, 20, 25, 30, 35, 40, 45, 50, 55, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['威力30+70，时间1.5s，范围100%', '威力33+70，时间1.9s，范围103%', '威力36+90，时间2.2s，范围106%', '威力41+90，时间2.4s，范围110%', '威力45+90，时间2.7s，范围114%', '威力50+90，时间2.9s，范围119%', '威力54+120，时间3.2s，范围124%', '威力60+120，时间3.4s，范围130%', '威力66+120，时间3.7s，范围136%', '威力75+150，时间4.2s，范围150%'],
        'sp': [3, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '掩护队友',
        'class': '防御',
        'max': 3,
        'level': [1, 17, 36],
        'require': [0, 0, 3],
        'detail': ['攻击上升40%', '攻击上升70%，范围125%', '攻击上升100%，范围200%'],
        'sp': [1, 2, 3]
      },
      {
        'name': '快速防御',
        'class': '防御',
        'max': 5,
        'level': [1, 7, 16, 27, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['自动格挡几率25%', '自动格挡几率30%', '自动格挡几率35%', '自动格挡几率40%', '自动格挡几率50%'],
        'sp': [1, 1, 2, 2, 3]
      },
      {
        'name': '盾击',
        'class': '防御',
        'max': 10,
        'level': [4, 9, 14, 19, 24, 29, 34, 40, 47, 54],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['威力20，击晕几率20%，盾击伤害+10%', '威力24，击晕几率25%，盾击伤害+20%', '威力28，击晕几率30%，盾击伤害+40%', '威力32，击晕几率35%，盾击伤害+60%', '威力36，击晕几率40%，盾击伤害+80%', '威力40，击晕几率45%，盾击伤害+100%', '威力44，击晕几率50%，盾击伤害+120%', '威力48，击晕几率55%，盾击伤害+140%', '威力52，击晕几率60%，盾击伤害+160%', '威力60，击晕几率80%，盾击伤害+200%'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 6]
      },
      {
        'name': '反弹投射攻击',
        'class': '防御',
        'max': 10,
        'level': [11, 16, 21, 27, 32, 37, 43, 48, 53, 58],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['反射几率30%', '反射几率35%，反射伤害20%', '反射几40%，反射伤害40%', '反射几率45%，反射伤害65%', '反射几率50%，反射伤害90%', '反射几率55%，反射伤害115%', '反射几率65%，反射伤害140%', '反射几率75%，反射伤害165%', '反射几率90%，反射伤害200%', '反射几率100%，反射伤害+250%'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 6]
      },
      {
        'name': '吸引注意',
        'class': '辅助',
        'max': 3,
        'level': [1, 12, 24],
        'require': [0, 0, 3],
        'detail': ['次数5，吸引敌人数5，发动伤害+10%', '次数5，吸引敌人数6，发动伤害+20%', '次数5，吸引敌人数9，发动伤害+30%'],
        'sp': [1, 2, 3]
      },
      {
        'name': '自我牺牲',
        'class': '辅助',
        'max': 5,
        'level': [5, 11, 19, 29, 42],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，发动减伤-30%', '次数3，发动减伤-40%', '次数3，发动减伤-50%', '次数3，发动减伤-60%', '次数3，发动减伤-70%'],
        'sp': [1, 1, 2, 3, 4]
      },
      {
        'name': '铜墙铁壁',
        'class': '辅助',
        'max': 10,
        'level': [9, 13, 18, 23, 28, 33, 38, 44, 50, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['防御耐久+20%，盾耐久减少-5%', '防御耐久+30%，盾耐久减少-7%', '防御耐久+40%，盾耐久减少-10%', '防御耐久+50%，盾耐久减少-13%', '防御耐久+60%，盾耐久减少-16%', '防御耐久+70%，盾耐久减少-19%', '防御耐久+85%，盾耐久减少-25%', '防御耐久+100%，盾耐久减少-31%', '防御耐久+120%，盾耐久减少-40%', '防御耐久+150%，盾耐久减少-50%'],
        'sp': [1, 1, 2, 2, 3, 3, 4, 4, 5, 6]
      }
    ],

    'drf': [
      {
        'name': '巨力摔掷',
        'class': '攻击',
        'max': 10,
        'level': [1, 6, 11, 16, 22, 28, 34, 40, 47, 55],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['投技伤害+30%', '投技伤害+45%，冲击波范围105%', '投技伤害+60%，冲击波范围110%', '投技伤害+75%，冲击波范围115%', '投技伤害+90%，冲击波范围120%', '投技伤害+110%，冲击波范围125%', '投技伤害+130%，冲击波范围130%', '投技伤害+160%，冲击波范围135%', '投技伤害+190%，冲击波范围140%', '投技伤害+250%，冲击波范围180%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '凶器之拳',
        'class': '攻击',
        'max': 10,
        'level': [1, 7, 12, 18, 23, 29, 35, 41, 48, 56],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['空手攻击力+20%', '空手攻击力+40%', '空手攻击力+60%', '空手攻击力+80%', '空手攻击力+100%', '空手攻击力+120%', '空手攻击力+140%', '空手攻击力+160%', '空手攻击力+180%', '空手攻击力+250%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '雄鹰俯冲',
        'class': '攻击',
        'max': 5,
        'level': [3, 10, 19, 30, 42],
        'require': [0, 0, 3, 3, 6],
        'detail': ['滑空攻击', '滑空攻击炸弹数3，炸弹威力60', '滑空攻击炸弹数4，炸弹威力70', '滑空攻击炸弹数5，炸弹威力80', '滑空攻击炸弹数6，炸弹威力90'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '雷神之锤',
        'class': '攻击',
        'max': 5,
        'level': [9, 17, 27, 39, 53],
        'require': [0, 0, 3, 3, 6],
        'detail': ['重攻击威力110，雷威力36，雷次数3', '重攻击威力120，雷威力39，雷次数5', '重攻击威力130，雷威力42，雷次数7', '重攻击威力150，雷威力47，雷次数9', '重攻击威力170，雷威力55，雷次数12'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '狂乱',
        'class': '攻击',
        'max': 5,
        'level': [15, 25, 36, 48, 60],
        'require': [0, 0, 3, 3, 6],
        'detail': ['威力40+50，持续时间1.5s', '威力45+60，持续时间2.0s', '威力50+70，持续时间2.5s', '威力60+80，持续时间3.0s', '威力70+100，持续时间4.0s'],
        'sp': [3, 1, 2, 3, 5]
      },
      {
        'name': '炸弹袋',
        'class': '道具',
        'max': 5,
        'level': [1, 8, 20, 33, 46],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数4', '使用次数6', '使用次数8', '使用次数10', '使用次数15'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '炸弹桶',
        'class': '道具',
        'max': 5,
        'level': [9, 13, 24, 38, 52],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数3', '使用次数4', '使用次数5', '使用次数6', '使用次数9'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '熔岩手环',
        'class': '道具',
        'max': 5,
        'level': [10, 17, 25, 34, 45],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数3，生效时间15s', '使用次数4，生效时间18s', '使用次数5，生效时间21s', '使用次数6，生效时间25s', '使用次数12，生效时间35s'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '火焰专精',
        'class': '道具',
        'max': 10,
        'level': [14, 19, 24, 29, 34, 39, 44, 49, 54, 59],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['攻击火伤害+20%', '攻击火伤害+25%', '攻击火伤害+30%', '攻击火伤害+35%', '攻击火伤害+40%', '攻击火伤害+50%', '攻击火伤害+60%', '攻击火伤害+70%', '攻击火伤害+80%', '攻击火伤害+100%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '珠宝狂人',
        'class': '辅助',
        'max': 10,
        'level': [1, 6, 11, 16, 21, 26, 32, 38, 45, 51],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['取得分数道具时，HP回复+2，耐久回复+1', '取得分数道具时，HP回复+3，耐久回复+1', '取得分数道具时，HP回复+4，耐久回复+1', '取得分数道具时，HP回复+5，耐久回复+2', '取得分数道具时，HP回复+6，耐久回复+2', '取得分数道具时，HP回复+7，耐久回复+2', '取得分数道具时，HP回复+8，耐久回复+3', '取得分数道具时，HP回复+9，耐久回复+3', '取得分数道具时，HP回复+10，耐久回复+3', '取得分数道具时，HP回复+15，耐久回复+5'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 5]
      },
      {
        'name': '石肤化',
        'class': '辅助',
        'max': 5,
        'level': [5, 13, 22, 33, 46],
        'require': [0, 0, 3, 3, 6],
        'detail': ['强化体魄时伤害-20%', '强化体魄时伤害-25%', '强化体魄时伤害-30%', '强化体魄时伤害-35%', '强化体魄时伤害-50%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '韧性',
        'class': '辅助',
        'max': 5,
        'level': [12, 20, 30, 41, 54],
        'require': [0, 0, 3, 3, 6],
        'detail': ['抵抗伤害量30', '抵抗伤害量45', '抵抗伤害量60', '抵抗伤害量80', '抵抗伤害量120'],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'elf': [
      {
        'name': '强力射击',
        'class': '弓箭',
        'max': 10,
        'level': [1, 5, 11, 17, 24, 31, 38, 45, 52, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['威力210', '威力220，冲击波范围105%', '威力230，冲击波范围110%', '威力240，冲击波范围115%', '威力250，冲击波范围120%', '威力260，冲击波范围125%', '威力270，冲击波范围130%', '威力280，冲击波范围135%', '威力290，冲击波范围140%', '威力320，冲击波范围170%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '连续射击',
        'class': '弓箭',
        'max': 4,
        'level': [1, 9, 18, 30],
        'require': [0, 0, 3, 3],
        'detail': ['连射数+1', '连射数+2', '连射数+3', '连射数+4'],
        'sp': [1, 2, 3, 5]
      },
      {
        'name': '箭筒容量',
        'class': '弓箭',
        'max': 5,
        'level': [3, 12, 23, 36, 50],
        'require': [0, 0, 3, 3, 6],
        'detail': ['最大箭数+2', '最大箭数+4', '最大箭数+7', '最大箭数+10', '最大箭数+15'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '震撼箭',
        'class': '弓箭',
        'max': 7,
        'level': [8, 14, 20, 27, 33, 40, 49],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['威力50', '威力65，冲击波范围105%', '威力80，冲击波范围110%', '威力95，冲击波范围115%', '威力110，冲击波范围120%', '威力125，冲击波范围125%', '威力175，冲击波范围145%'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '多重箭',
        'class': '弓箭',
        'max': 4,
        'level': [15, 26, 39, 53],
        'require': [0, 0, 3, 3],
        'detail': ['同时发射数+1', '同时发射数+2', '同时发射数+3', '同时发射数+4'],
        'sp': [1, 2, 3, 5]
      },
      {
        'name': '淬毒锐锋',
        'class': '道具',
        'max': 5,
        'level': [1, 7, 16, 25, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数20', '使用次数25', '使用次数30', '使用次数35', '使用次数50'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '副手匕首',
        'class': '道具',
        'max': 5,
        'level': [4, 10, 19, 30, 45],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数3', '使用次数4', '使用次数5', '使用次数6', '使用次数9'],
        'sp': [1, 1, 2, 2, 3]
      },
      {
        'name': '火蜥蜴之油',
        'class': '道具',
        'max': 5,
        'level': [13, 22, 33, 44, 57],
        'require': [0, 0, 3, 3, 6],
        'detail': ['使用次数20', '使用次数25', '使用次数30', '使用次数35', '使用次数50'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '元素知识',
        'class': '辅助',
        'max': 10,
        'level': [1, 6, 11, 16, 21, 26, 32, 37, 43, 50],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['可使用精灵魔法', '魔法伤害+20%', '魔法伤害+30%', '魔法伤害+40%', '魔法伤害+50%', '魔法伤害+60%', '魔法伤害+70%', '魔法伤害+80%', '魔法伤害+90%', '魔法伤害+100%'],
        'sp': [1, 1, 1, 2, 2, 2, 3, 3, 4, 5]
      },
      {
        'name': '强化靴子',
        'class': '辅助',
        'max': 10,
        'level': [1, 7, 12, 17, 23, 29, 35, 41, 47, 54],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['防御力对伤害加成50%', '防御力对伤害加成75%', '防御力对伤害加成100%', '防御力对伤害加成125%', '防御力对伤害加成150%', '防御力对伤害加成175%', '防御力对伤害加成200%', '防御力对伤害加成230%', '防御力对伤害加成260%', '防御力对伤害加成300%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
      },
      {
        'name': '背刺',
        'class': '辅助',
        'max': 10,
        'level': [5, 10, 15, 20, 25, 30, 36, 42, 48, 55],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['匕首背后伤害+80%', '匕首背后伤害+100%', '匕首背后伤害+120%', '匕首背后伤害+135%', '匕首背后伤害+155%', '匕首背后伤害+175%', '匕首背后伤害+195%', '匕首背后伤害+210%', '匕首背后伤害+230%', '匕首背后伤害+300%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '减轻伤害',
        'class': '辅助',
        'max': 5,
        'level': [9, 18, 28, 39, 51],
        'require': [0, 0, 3, 3, 6],
        'detail': ['拉弓时承受伤害-20%，击退抗性50', '拉弓时承受伤害-25%，击退抗性66', '拉弓时承受伤害-30%，击退抗性75', '拉弓时承受伤害-35%，击退抗性80', '拉弓时承受伤害-50%，击退抗性83'],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'wiz': [
      {
        'name': '专心致志',
        'class': '辅助',
        'max': 10,
        'level': [1, 6, 11, 16, 21, 27, 33, 39, 45, 51],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['MP充能速度+10%', 'MP充能速度+14%', 'MP充能速度+18%', 'MP充能速度+22%', 'MP充能速度+26%', 'MP充能速度+30%', 'MP充能速度+34%', 'MP充能速度+38%', 'MP充能速度+42%', 'MP充能速度+50%'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '萃取魔力',
        'class': '辅助',
        'max': 7,
        'level': [1, 7, 13, 19, 26, 34, 42],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['魔法射击击中MP回复量5', '魔法射击击中MP回复量7', '魔法射击击中MP回复量9', '魔法射击击中MP回复量11', '魔法射击击中MP回复量13', '魔法射击击中MP回复量15', '魔法射击击中MP回复量20'],
        'sp': [1, 1, 1, 2, 2, 3, 4]
      },
      {
        'name': '精神吸收',
        'class': '辅助',
        'max': 5,
        'level': [4, 10, 17, 25, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['击倒敌人MP回复15', '击倒敌人MP回复18', '击倒敌人MP回复21', '击倒敌人MP回复24', '击倒敌人MP回复30'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '魔力点数提升',
        'class': '辅助',
        'max': 5,
        'level': [9, 18, 28, 38, 49],
        'require': [0, 0, 3, 3, 6],
        'detail': ['MP最大值+30', 'MP最大值+50', 'MP最大值+70', 'MP最大值+100', 'MP最大值+150'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '火焰护盾',
        'class': '辅助',
        'max': 3,
        'level': [8, 24, 40],
        'require': [0, 3, 6],
        'detail': ['次数3，伤害+20%，时间15s', '次数5，伤害+30%，时间20s', '次数7，伤害+50%，时间30s'],
        'sp': [1, 3, 5]
      },
      {
        'name': '烈焰术',
        'class': '攻击',
        'max': 5,
        'level': [1, 6, 12, 20, 29],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，威力25', '次数4，威力30', '次数5，威力35', '次数6，威力40', '次数9，威力50'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '风暴术',
        'class': '攻击',
        'max': 7,
        'level': [1, 7, 14, 22, 31, 41, 52],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['次数3，威力10', '次数3，威力12', '次数4，威力14', '次数4，威力16', '次数5，威力18', '次数6，威力20', '次数9，威力25'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '烈焰爆发',
        'class': '攻击',
        'max': 7,
        'level': [3, 9, 16, 23, 32, 43, 56],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['次数3，威力30', '次数3，威力35', '次数4，威力39', '次数4，威力44', '次数5，威力45', '次数6，威力50', '次数9，威力60'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '闪电强击',
        'class': '攻击',
        'max': 10,
        'level': [7, 12, 17, 22, 28, 34, 40, 46, 53, 60],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['次数3，威力40', '次数3，威力46', '次数3，威力52', '次数4，威力58', '次数4，威力64', '次数4，威力70', '次数5，威力76', '次数5，威力82', '次数5，威力88', '次数7，威力110'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '陨石术',
        'class': '攻击',
        'max': 3,
        'level': [15, 30, 50],
        'require': [0, 3, 6],
        'detail': ['次数3，威力1200，陨石数3', '次数3，威力1350，陨石数4', '次数3，威力1500，陨石数5'],
        'sp': [3, 4, 5]
      },
      {
        'name': '创造魔像',
        'class': '特殊',
        'max': 5,
        'level': [1, 8, 16, 25, 36],
        'require': [0, 0, 3, 3, 6],
        'detail': ['魔像等级是玩家等级的50%', '魔像等级是玩家等级的60%', '魔像等级是玩家等级的70%', '魔像等级是玩家等级的80%', '魔像等级是玩家等级的100%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '浮游术',
        'class': '特殊',
        'max': 3,
        'level': [1, 14, 29],
        'require': [0, 0, 3],
        'detail': ['空中魔法伤害+20%', '空中魔法伤害+35%', '空中魔法伤害+50%'],
        'sp': [1, 3, 5]
      },
      {
        'name': '缓速术',
        'class': '特殊',
        'max': 5,
        'level': [5, 11, 18, 26, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数4，速度降低60%', '次数5，速度降低65%，范围105%', '次数6，速度降低70%，范围110%', '次数7，速度降低75%，范围120%', '次数9，速度降低85%，范围130%'],
        'sp': [1, 1, 2, 2, 4]
      },
      {
        'name': '灭杀术',
        'class': '特殊',
        'max': 5,
        'level': [13, 21, 30, 39, 48],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3', '次数4', '次数5', '次数6', '次数9'],
        'sp': [1, 1, 2, 3, 5]
      }
    ],

    'sor': [
      {
        'name': '精神吸收',
        'class': '辅助',
        'max': 10,
        'level': [1, 6, 11, 16, 21, 27, 33, 39, 45, 51],
        'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
        'detail': ['击倒敌人MP回复15', '击倒敌人MP回复18', '击倒敌人MP回复21', '击倒敌人MP回复24', '击倒敌人MP回复27', '击倒敌人MP回复30', '击倒敌人MP回复34', '击倒敌人MP回复38', '击倒敌人MP回复42', '击倒敌人MP回复50'],
        'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 5]
      },
      {
        'name': '萃取魔力',
        'class': '辅助',
        'max': 7,
        'level': [1, 7, 13, 19, 26, 34, 42],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['魔法射击击中MP回复量5', '魔法射击击中MP回复量7', '魔法射击击中MP回复量9', '魔法射击击中MP回复量11', '魔法射击击中MP回复量13', '魔法射击击中MP回复量15', '魔法射击击中MP回复量20'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '专心致志',
        'class': '辅助',
        'max': 5,
        'level': [4, 10, 17, 25, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['MP充能速度+10%', 'MP充能速度+14%', 'MP充能速度+18%', 'MP充能速度+22%', 'MP充能速度+30%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '魔力点数提升',
        'class': '辅助',
        'max': 5,
        'level': [9, 18, 28, 38, 49],
        'require': [0, 0, 3, 3, 6],
        'detail': ['MP最大值+30', 'MP最大值+50', 'MP最大值+70', 'MP最大值+100', 'MP最大值+150'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '冰牢术',
        'class': '辅助',
        'max': 3,
        'level': [1, 14, 30],
        'require': [0, 3, 6],
        'detail': ['次数5，威力7，时间8s', '次数7，威力63，时间12s', '次数9，威力75，时间20s'],
        'sp': [1, 3, 5]
      },
      {
        'name': '防护术',
        'class': '辅助',
        'max': 5,
        'level': [5, 13, 22, 33, 45],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，时间20s，伤害减少25%', '次数3，时间24s，伤害减少30%', '次数4，时间28s，伤害减少35%', '次数4，时间32s，伤害减少40%', '次数5，时间40s，伤害减少50%'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '重力术',
        'class': '辅助',
        'max': 3,
        'level': [11, 24, 40],
        'require': [0, 0, 3],
        'detail': ['次数3，威力10，时间5s，引力400', '次数5，威力16，时间10s，引力750', '次数8，威力25，时间15s，引力1200'],
        'sp': [1, 3, 5]
      },
      {
        'name': '雷云术',
        'class': '攻击',
        'max': 7,
        'level': [1, 6, 12, 18, 25, 32, 41],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['次数3，威力80，时间20s', '次数3，威力92，时间22s', '次数4，威力104，时间24s', '次数4，威力116，时间26s', '次数5，威力128，时间28s', '次数5，威力140，时间30s', '次数7，威力160，时间32s'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '落石术',
        'class': '攻击',
        'max': 7,
        'level': [7, 13, 20, 27, 35, 44, 53],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['次数5，威力350', '次数5，威力420', '次数6，威力490', '次数6，威力560', '次数7，威力665', '次数7，威力770', '次数9，威力875'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      },
      {
        'name': '暴雪术',
        'class': '攻击',
        'max': 5,
        'level': [14, 23, 34, 46, 58],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数3，威力35，时间4s', '次数3，威力40，时间5s', '次数4，威力42，时间6s', '次数4，威力44，时间7s', '次数5，威力50，时间10s'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '操控骷髅',
        'class': '特殊',
        'max': 5,
        'level': [1, 8, 16, 25, 36],
        'require': [0, 0, 3, 3, 6],
        'detail': ['骷髅等级是玩家等级的50%，最大数1', '骷髅等级是玩家等级的60%，最大数2', '骷髅等级是玩家等级的70%，最大数2', '骷髅等级是玩家等级的80%，最大数3', '骷髅等级是玩家等级的100%，最大数4'],
        'sp': [1, 1, 2, 3, 5]
      },
      {
        'name': '浮游术',
        'class': '特殊',
        'max': 3,
        'level': [1, 14, 29],
        'require': [0, 0, 3],
        'detail': ['空中魔法伤害+20%', '空中魔法伤害+35%', '空中魔法伤害+50%'],
        'sp': [1, 3, 5]
      },
      {
        'name': '造食术',
        'class': '特殊',
        'max': 5,
        'level': [3, 9, 17, 26, 35],
        'require': [0, 0, 3, 3, 6],
        'detail': ['次数5，做成数4', '次数5，做成数5', '次数7，做成数6', '次数7，做成数7', '次数9，做成数8'],
        'sp': [1, 1, 2, 2, 4]
      },
      {
        'name': '诅咒',
        'class': '特殊',
        'max': 3,
        'level': [6, 16, 31],
        'require': [0, 0, 3],
        'detail': ['使用次数5，魔法发动个数1', '使用次数7，魔法发动个数2', '使用次数9，魔法发动个数3'],
        'sp': [1, 3, 5]
      },
      {
        'name': '石化术',
        'class': '特殊',
        'max': 7,
        'level': [15, 22, 29, 36, 43, 51, 60],
        'require': [0, 0, 3, 3, 6, 6, 9],
        'detail': ['次数3，效果时间5s', '次数3，效果时间6s', '次数4，效果时间7s', '次数4，效果时间8s', '次数5，效果时间9s', '次数5，效果时间10s', '次数7，效果时间15s'],
        'sp': [1, 1, 2, 2, 3, 3, 5]
      }
    ]
  },
  'common': [
    {
      'name': '滑踢',
      'class': '一般',
      'max': 5,
      'level': [1, 10, 20, 31, 40],
      'require': [0, 0, 3, 3, 6],
      'detail': ['滑铲威力30，击退30%', '滑铲威力34，击退40%', '滑铲威力40，击退55%', '滑铲威力46，击退70%', '滑铲威力60，击退100%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '金币治疗',
      'class': '一般',
      'max': 5,
      'level': [1, 5, 14, 27, 42],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时HP回复+2', '取得硬币时HP回复+3', '取得硬币时HP回复+5', '取得硬币时HP回复+7', '取得硬币时HP回复+10'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '金币得分',
      'class': '一般',
      'max': 5,
      'level': [1, 8, 17, 29, 43],
      'require': [0, 0, 3, 3, 6],
      'detail': ['取得硬币时取得分数10', '取得硬币时取得分数20', '取得硬币时取得分数40', '取得硬币时取得分数60', '取得硬币时取得分数100'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '提升生命力',
      'class': '一般',
      'max': 10,
      'level': [0, 7, 13, 19, 25, 31, 38, 45, 52, 59],
      'require': [0, 0, 3, 3, 6, 6, 9, 9, 12, 12],
      'detail': ['HP+20', 'HP+35', 'HP+50', 'HP+65', 'HP+80', 'HP+100', 'HP+120', 'HP+145', 'HP+170', 'HP+200'],
      'sp': [1, 1, 1, 2, 2, 3, 3, 4, 4, 6]
    },
    {
      'name': '营养学家',
      'class': '一般',
      'max': 5,
      'level': [3, 11, 24, 37, 51],
      'require': [0, 0, 3, 3, 6],
      'detail': ['食物的HP回复量+20%', '食物的HP回复量+25%', '食物的HP回复量+30%', '食物的HP回复量+35%', '食物的HP回复量+50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '保养装备',
      'class': '一般',
      'max': 5,
      'level': [6, 13, 23, 34, 47],
      'require': [0, 0, 3, 3, 6],
      'detail': ['十字弓等道具使用次数不易减少几率20%', '十字弓等道具使用次数不易减少几率25%', '十字弓等道具使用次数不易减少几率30%', '十字弓等道具使用次数不易减少几率35%', '十字弓等道具使用次数不易减少几率50%'],
      'sp': [1, 1, 2, 3, 4]
    },
    {
      'name': '灵巧之手',
      'class': '一般',
      'max': 7,
      'level': [9, 16, 22, 29, 36, 44, 53],
      'require': [0, 0, 3, 3, 6, 6, 9],
      'detail': ['减少道具使用后的再使用等待时间10%', '减少道具使用后的再使用等待时间15%', '减少道具使用后的再使用等待时间20%', '减少道具使用后的再使用等待时间25%', '减少道具使用后的再使用等待时间30%', '减少道具使用后的再使用等待时间35%', '减少道具使用后的再使用等待时间50%'],
      'sp': [1, 1, 2, 2, 3, 3, 5]
    },
    {
      'name': '闪避',
      'class': '一般',
      'max': 3,
      'level': [12, 32, 52],
      'require': [0, 3, 6],
      'detail': ['回避回数+1', '回避回数+2', '回避回数+3'],
      'sp': [2, 3, 4]
    },
    {
      'name': '额外口袋',
      'class': '一般',
      'max': 3,
      'level': [15, 30, 50],
      'require': [0, 3, 6],
      'detail': ['容量8', '容量9', '容量10'],
      'sp': [2, 4, 6]
    }
  ]
}
